Phase-5-Capstone-Trivia-project/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def current_user
            @user ||= User.find_by(id: session[:user_id]) if session[:user_id]