Phase-5-Capstone-Trivia-project/app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
    def index
        render json: Game.all, status: :ok