Phase-5-Capstone-Trivia-project/app/controllers/users_controller.rb

    def index
        render json: User.all, status: :ok
---
SELECT "users".* FROM "users"

    def create
        new_user = User.create!(user_params)
---
INSERT INTO "users" ("email", "password_digest", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def update
        render json: @user.update!(user_params), status: :ok
---
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "jc1999"], ["updated_at", "2023-03-08 01:01:11.335192"], ["id", 5]]

    def oauth
        user = User.find_or_create_by(email: params[:email]) do |u|
---
INSERT INTO "users" ("email", "password_digest", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jccaropino@gmail.com"], ["LIMIT", 1]]