Phase-5-Capstone-Trivia-project/app/controllers/user_games_controller.rb

SELECT "user_games".* FROM "user_games"
---
    def index
        render json: UserGame.order(params[:score]).reverse, status: :ok